SpenceKonde/ATTinyCore/boards.txt
attiny828.name=ATtiny828
attiny828.upload.maximum_size=8192
attiny828.upload.maximum_data_size=512
attiny828.upload.tool=avrdude
attiny828.bootloader.tool=avrdude
attiny828.bootloader.unlock_bits=0x3F
attiny828.bootloader.lock_bits=0x3F
attiny828.build.mcu=attiny828
attiny828.build.core=tinymodern
attiny828.build.board=AVR_ATTINY828
attiny828.menu.clock.8internal=8 MHz (internal)
attiny828.menu.clock.8internal.bootloader.low_fuses=0xEE
attiny828.menu.clock.8internal.build.f_cpu=8000000L
attiny828.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attiny828.menu.clock.1internal=1 MHz (internal)
attiny828.menu.clock.1internal.bootloader.low_fuses=0x6E
attiny828.menu.clock.1internal.build.f_cpu=1000000L
attiny828.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attiny828.menu.bod.disable=Disabled
attiny828.menu.bod.disable.bootloader.extended_fuses=0xFF
attiny828.menu.bod.disable.bootloader.high_fuses=0xD7
attiny828.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny828.menu.bod.1v8.bootloader.extended_fuses=0x5F
attiny828.menu.bod.1v8.bootloader.high_fuses=0xD7
attiny828.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny828.menu.bod.2v7.bootloader.extended_fuses=0x5F
attiny828.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny828.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny828.menu.bod.4v3.bootloader.extended_fuses=0x5F
attiny828.menu.bod.4v3.bootloader.high_fuses=0xD4

attiny828opti.name=ATtiny828 (Optiboot)
attiny828opti.upload.maximum_size=7680
attiny828opti.upload.maximum_data_size=512
attiny828opti.upload.protocol=arduino
attiny828opti.upload.speed=57600
attiny828opti.upload.tool=avrdude
attiny828opti.bootloader.tool=avrdude
attiny828opti.bootloader.unlock_bits=0x3F
attiny828opti.bootloader.lock_bits=0x3F
attiny828opti.build.mcu=attiny828
attiny828opti.build.core=tinymodern
attiny828opti.build.board=AVR_ATTINY828
attiny828opti.bootloader.low_fuses=0xEE
attiny828opti.build.f_cpu=8000000L
attiny828opti.menu.vcc.3v3=Under 4.0 V
attiny828opti.menu.vcc.3v3.bootloader.file=optiboot/optiboot_attiny828at8.hex
attiny828opti.menu.vcc.5v=Over 4.0 V
attiny828opti.menu.vcc.5v.bootloader.file=optiboot/optiboot_attiny828at8_5v.hex
attiny828opti.menu.bod.disable=Disabled
attiny828opti.menu.bod.disable.bootloader.extended_fuses=0xFA
attiny828opti.menu.bod.disable.bootloader.high_fuses=0xD7
attiny828opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny828opti.menu.bod.1v8.bootloader.extended_fuses=0x5A
attiny828opti.menu.bod.1v8.bootloader.high_fuses=0xD7
attiny828opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny828opti.menu.bod.2v7.bootloader.extended_fuses=0x5A
attiny828opti.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny828opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny828opti.menu.bod.4v3.bootloader.extended_fuses=0x5A
attiny828opti.menu.bod.4v3.bootloader.high_fuses=0xD4


attinyx5.name=ATtiny x5 series
attinyx5.upload.maximum_size=8192
attinyx5.upload.maximum_data_size=512
attinyx5.upload.tool=avrdude
attinyx5.bootloader.tool=avrdude
attinyx5.bootloader.unlock_bits=0xFF
attinyx5.bootloader.lock_bits=0xFF
attinyx5.build.core=tiny
attinyx5.build.board=AVR_ATTINYX5
attinyx5.bootloader.extended_fuses=0xFF
attinyx5.menu.TimerClockSource.default=CPU
attinyx5.menu.TimerClockSource.pll=64MHz
attinyx5.menu.TimerClockSource.pll.build.extra_flags=-DPLLTIMER1
attinyx5.menu.TimerClockSource.lowpll=32MHz
attinyx5.menu.TimerClockSource.lowpll.build.extra_flags=-DLOWPLLTIMER1
attinyx5.menu.chip.85=ATtiny85
attinyx5.menu.chip.85.build.mcu=attiny85
attinyx5.menu.chip.85.upload.maximum_size=8192
attinyx5.menu.chip.85.upload.maximum_data_size=512
attinyx5.menu.chip.45=ATtiny45
attinyx5.menu.chip.45.build.mcu=attiny45
attinyx5.menu.chip.45.upload.maximum_size=4096
attinyx5.menu.chip.45.upload.maximum_data_size=256
attinyx5.menu.chip.25=ATtiny25
attinyx5.menu.chip.25.build.mcu=attiny25
attinyx5.menu.chip.25.upload.maximum_size=2048
attinyx5.menu.chip.25.upload.maximum_data_size=128
attinyx5.menu.clock.8internal=8 MHz (internal)
attinyx5.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx5.menu.clock.8internal.build.f_cpu=8000000L
attinyx5.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.16pll=16 MHz (PLL)
attinyx5.menu.clock.16pll.bootloader.low_fuses=0xF1
attinyx5.menu.clock.16pll.build.f_cpu=16000000L
attinyx5.menu.clock.16pll.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.20external=20 MHz (external)
attinyx5.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx5.menu.clock.20external.build.f_cpu=20000000L
attinyx5.menu.clock.20external.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.16external=16 MHz (external)
attinyx5.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx5.menu.clock.16external.build.f_cpu=16000000L
attinyx5.menu.clock.16external.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.12external=12 MHz (external)
attinyx5.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx5.menu.clock.12external.build.f_cpu=12000000L
attinyx5.menu.clock.12external.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.8external=8 MHz (external)
attinyx5.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx5.menu.clock.8external.build.f_cpu=8000000L
attinyx5.menu.clock.8external.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.6external=6 MHz (external)
attinyx5.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx5.menu.clock.6external.build.f_cpu=6000000L
attinyx5.menu.clock.6external.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.4external=4 MHz (external)
attinyx5.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx5.menu.clock.4external.build.f_cpu=4000000L
attinyx5.menu.clock.4external.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.1internal=1 MHz (internal)
attinyx5.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx5.menu.clock.1internal.build.f_cpu=1000000L
attinyx5.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.128internal=128 kHz (internal)
attinyx5.menu.clock.128internal.bootloader.low_fuses=0xC4
attinyx5.menu.clock.128internal.build.f_cpu=128000L
attinyx5.menu.clock.128internal.bootloader.file=empty/empty_all.hex
attinyx5.menu.bod.disable=B.O.D. Disabled
attinyx5.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx5.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx5.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx5.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx5.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx5.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx5.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx5.build.variant=tinyX5

