SpenceKonde/ATTinyCore/boards.txt
attinyx4.name=ATtiny x4 series
attinyx4.upload.maximum_size=8192
attinyx4.upload.maximum_data_size=512
attinyx4.upload.tool=avrdude
attinyx4.build.board=AVR_ATTINYX4
attinyx4.bootloader.tool=avrdude
attinyx4.bootloader.unlock_bits=0xFF
attinyx4.bootloader.lock_bits=0xFF
attinyx4.menu.chip.84=ATtiny84
attinyx4.menu.chip.84.build.mcu=attiny84
attinyx4.menu.chip.84.upload.maximum_size=8192
attinyx4.menu.chip.84.upload.maximum_data_size=512
attinyx4.menu.chip.44=ATtiny44
attinyx4.menu.chip.44.build.mcu=attiny44
attinyx4.menu.chip.44.upload.maximum_size=4096
attinyx4.menu.chip.44.upload.maximum_data_size=256
attinyx4.menu.chip.24=ATtiny24
attinyx4.menu.chip.24.build.mcu=attiny24
attinyx4.menu.chip.24.upload.maximum_size=2048
attinyx4.menu.chip.24.upload.maximum_data_size=128
attinyx4.build.core=tiny
attinyx4.bootloader.extended_fuses=0xFF
attinyx4.menu.clock.8internal=8 MHz (internal)
attinyx4.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx4.menu.clock.8internal.build.f_cpu=8000000L
attinyx4.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attinyx4.menu.clock.20external=20 MHz (external)
attinyx4.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx4.menu.clock.20external.build.f_cpu=20000000L
attinyx4.menu.clock.20external.bootloader.file=empty/empty_all.hex
attinyx4.menu.clock.16external=16 MHz (external)
attinyx4.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx4.menu.clock.16external.build.f_cpu=16000000L
attinyx4.menu.clock.16external.bootloader.file=empty/empty_all.hex
attinyx4.menu.clock.12external=12 MHz (external)
attinyx4.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx4.menu.clock.12external.build.f_cpu=12000000L
attinyx4.menu.clock.12external.bootloader.file=empty/empty_all.hex
attinyx4.menu.clock.8external=8 MHz (external)
attinyx4.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx4.menu.clock.8external.build.f_cpu=8000000L
attinyx4.menu.clock.8external.bootloader.file=empty/empty_all.hex
attinyx4.menu.clock.6external=6 MHz (external)
attinyx4.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx4.menu.clock.6external.build.f_cpu=6000000L
attinyx4.menu.clock.6external.bootloader.file=empty/empty_all.hex
attinyx4.menu.clock.4external=4 MHz (external)
attinyx4.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx4.menu.clock.4external.build.f_cpu=4000000L
attinyx4.menu.clock.4external.bootloader.file=empty/empty_all.hex
attinyx4.menu.clock.1internal=1 MHz (internal)
attinyx4.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx4.menu.clock.1internal.build.f_cpu=1000000L
attinyx4.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attinyx4.menu.bod.disable=B.O.D. Disabled
attinyx4.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx4.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx4.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx4.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx4.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx4.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx4.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx4.menu.pinmapping.old=Counterclockwise (like ATTinyCore)
attinyx4.menu.pinmapping.old.build.variant=tinyX4
attinyx4.menu.pinmapping.new=Clockwise (like damellis core)
attinyx4.menu.pinmapping.new.build.variant=tinyX4_reverse

attinyx61.name=ATtiny x61 series
attinyx61.upload.maximum_size=8192
attinyx61.upload.maximum_data_size=512
attinyx61.upload.tool=avrdude
attinyx61.build.board=AVR_ATTINYX61
attinyx61.bootloader.tool=avrdude
attinyx61.bootloader.unlock_bits=0x03
attinyx61.bootloader.lock_bits=0x03
attinyx61.build.mcu=attiny861
attinyx61.build.core=tiny
attinyx61.menu.TimerClockSource.default=CPU
attinyx61.menu.TimerClockSource.pll=64MHz
attinyx61.menu.TimerClockSource.pll.build.extra_flags=-DPLLTIMER1
attinyx61.menu.TimerClockSource.lowpll=32MHz
attinyx61.menu.TimerClockSource.lowpll.build.extra_flags=-DLOWPLLTIMER1
attinyx61.menu.chip.861=ATtiny861
attinyx61.menu.chip.861.build.mcu=attiny861
attinyx61.menu.chip.861.upload.maximum_size=8192
attinyx61.menu.chip.861.upload.maximum_data_size=512
attinyx61.menu.chip.461=ATtiny461
attinyx61.menu.chip.461.build.mcu=attiny461
attinyx61.menu.chip.461.upload.maximum_size=4096
attinyx61.menu.chip.461.upload.maximum_data_size=256
attinyx61.menu.chip.261=ATtiny261
attinyx61.menu.chip.261.build.mcu=attiny261
attinyx61.menu.chip.261.upload.maximum_size=2048
attinyx61.menu.chip.261.upload.maximum_data_size=128
attinyx61.bootloader.extended_fuses=0x01
attinyx61.menu.clock.8internal=8 MHz (internal)
attinyx61.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx61.menu.clock.8internal.build.f_cpu=8000000L
attinyx61.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.20external=20 MHz (external)
attinyx61.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.20external.build.f_cpu=20000000L
attinyx61.menu.clock.20external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.16external=16 MHz (external)
attinyx61.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.16external.build.f_cpu=16000000L
attinyx61.menu.clock.16external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.16pll=16 MHz (PLL)
attinyx61.menu.clock.16pll.bootloader.low_fuses=0xF1
attinyx61.menu.clock.16pll.build.f_cpu=16000000L
attinyx61.menu.clock.16pll.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.12external=12 MHz (external)
attinyx61.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.12external.build.f_cpu=12000000L
attinyx61.menu.clock.12external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.8external=8 MHz (external)
attinyx61.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.8external.build.f_cpu=8000000L
attinyx61.menu.clock.8external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.6external=6 MHz (external)
attinyx61.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx61.menu.clock.6external.build.f_cpu=6000000L
attinyx61.menu.clock.6external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.4external=4 MHz (external)
attinyx61.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx61.menu.clock.4external.build.f_cpu=4000000L
attinyx61.menu.clock.4external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.1internal=1 MHz (internal)
attinyx61.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx61.menu.clock.1internal.build.f_cpu=1000000L
attinyx61.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attinyx61.menu.bod.disable=B.O.D. Disabled
attinyx61.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx61.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx61.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx61.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx61.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx61.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx61.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx61.build.variant=tinyX61


attiny167opti.name=ATtiny167 (Optiboot)
attiny167opti.upload.maximum_data_size=512
attiny167opti.upload.protocol=arduino
attiny167opti.upload.tool=avrdude
attiny167opti.build.board=AVR_ATTINYX7
attiny167opti.bootloader.tool=avrdude
attiny167opti.bootloader.unlock_bits=0xFF
attiny167opti.bootloader.lock_bits=0xFF
attiny167opti.build.core=tiny
attiny167opti.bootloader.extended_fuses=0xFE
attiny167opti.build.mcu=attiny167
attiny167opti.upload.maximum_size=15744
attiny167opti.menu.clock.8internal=8 MHz (internal)
attiny167opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attiny167opti.menu.clock.8internal.build.f_cpu=8000000L
attiny167opti.menu.clock.8internal.bootloader.file=optiboot/optiboot_attiny167at8.hex
attiny167opti.menu.clock.8internal.upload.speed=57600
attiny167opti.menu.clock.16external=16 MHz (external)
attiny167opti.menu.clock.16external.bootloader.low_fuses=0xFF
attiny167opti.menu.clock.16external.build.f_cpu=16000000L
attiny167opti.menu.clock.16external.bootloader.file=optiboot/optiboot_attiny167at16.hex
attiny167opti.menu.clock.16external.upload.speed=115200
attiny167opti.menu.clock.12external=12 MHz (external)
attiny167opti.menu.clock.12external.bootloader.low_fuses=0xFF
attiny167opti.menu.clock.12external.build.f_cpu=12000000L
attiny167opti.menu.clock.12external.bootloader.file=optiboot/optiboot_attiny167at12.hex
attiny167opti.menu.clock.12external.upload.speed=115200
attiny167opti.menu.clock.8external=8 MHz (external)
attiny167opti.menu.clock.8external.bootloader.low_fuses=0xFF
attiny167opti.menu.clock.8external.build.f_cpu=8000000L
attiny167opti.menu.clock.8external.bootloader.file=optiboot/optiboot_attiny167at8.hex
attiny167opti.menu.clock.8external.upload.speed=57600
attiny167opti.menu.bod.disable=B.O.D. Disabled
attiny167opti.menu.bod.disable.bootloader.high_fuses=0xD7
attiny167opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny167opti.menu.bod.1v8.bootloader.high_fuses=0xD6
attiny167opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny167opti.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny167opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny167opti.menu.bod.4v3.bootloader.high_fuses=0xD4
attiny167opti.menu.pinmapping.new=New style (down each side)
attiny167opti.menu.pinmapping.new.build.variant=tinyX7_New
attiny167opti.menu.pinmapping.old=Old style (SCL on 13)
attiny167opti.menu.pinmapping.old.build.variant=tinyX7

attiny87opti.name=ATtiny87 (Optiboot)
attiny87opti.upload.maximum_data_size=512
attiny87opti.upload.protocol=arduino
attiny87opti.upload.tool=avrdude
attiny87opti.build.board=AVR_ATTINYX7
attiny87opti.bootloader.tool=avrdude
attiny87opti.bootloader.unlock_bits=0xFF
attiny87opti.bootloader.lock_bits=0xFF
attiny87opti.build.core=tiny
attiny87opti.bootloader.extended_fuses=0xFE
attiny87opti.build.mcu=attiny87
attiny87opti.upload.maximum_size=7552
attiny87opti.menu.clock.8internal=8 MHz (internal)
attiny87opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attiny87opti.menu.clock.8internal.build.f_cpu=8000000L
attiny87opti.menu.clock.8internal.bootloader.file=optiboot/optiboot_attiny87at8.hex
attiny87opti.menu.clock.8internal.upload.speed=57600
attiny87opti.menu.clock.16external=16 MHz (external)
attiny87opti.menu.clock.16external.bootloader.low_fuses=0xFF
attiny87opti.menu.clock.16external.build.f_cpu=16000000L
attiny87opti.menu.clock.16external.bootloader.file=optiboot/optiboot_attiny87at16.hex
attiny87opti.menu.clock.16external.upload.speed=115200
attiny87opti.menu.clock.12external=12 MHz (external)
attiny87opti.menu.clock.12external.bootloader.low_fuses=0xFF
attiny87opti.menu.clock.12external.build.f_cpu=12000000L
attiny87opti.menu.clock.12external.bootloader.file=optiboot/optiboot_attiny167at12.hex
attiny87opti.menu.clock.12external.upload.speed=115200
attiny87opti.menu.clock.8external=8 MHz (external)
attiny87opti.menu.clock.8external.bootloader.low_fuses=0xFF
attiny87opti.menu.clock.8external.build.f_cpu=8000000L
attiny87opti.menu.clock.8external.bootloader.file=optiboot/optiboot_attiny87at8.hex
attiny87opti.menu.clock.8external.upload.speed=57600
attiny87opti.menu.bod.disable=B.O.D. Disabled
attiny87opti.menu.bod.disable.bootloader.high_fuses=0xD7
attiny87opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny87opti.menu.bod.1v8.bootloader.high_fuses=0xD6
attiny87opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny87opti.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny87opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny87opti.menu.bod.4v3.bootloader.high_fuses=0xD4
attiny87opti.menu.pinmapping.new=New style (down each side)
attiny87opti.menu.pinmapping.new.build.variant=tinyX7_New
attiny87opti.menu.pinmapping.old=Old style (SCL on 13)
attiny87opti.menu.pinmapping.old.build.variant=tinyX7

attinyx7.name=ATtiny x7 series
attinyx7.upload.maximum_data_size=512
attinyx7.upload.tool=avrdude
attinyx7.build.board=AVR_ATTINYX7
attinyx7.bootloader.tool=avrdude
attinyx7.bootloader.unlock_bits=0xFF
attinyx7.bootloader.lock_bits=0xFF
attinyx7.build.core=tiny
attinyx7.bootloader.extended_fuses=0xFF
attinyx7.menu.chip.167=ATtiny167
attinyx7.menu.chip.167.build.mcu=attiny167
attinyx7.menu.chip.167.upload.maximum_size=16384
attinyx7.menu.chip.87=ATtiny87
attinyx7.menu.chip.87.build.mcu=attiny87
attinyx7.menu.chip.87.upload.maximum_size=8196
attinyx7.upload.maximum_data_size=512
attinyx7.menu.clock.8internal=8 MHz (internal)
attinyx7.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx7.menu.clock.8internal.build.f_cpu=8000000L
attinyx7.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attinyx7.menu.clock.20external=20 MHz (external)
attinyx7.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.20external.build.f_cpu=20000000L
attinyx7.menu.clock.20external.bootloader.file=empty/empty_all.hex
attinyx7.menu.clock.16external=16 MHz (external)
attinyx7.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.16external.build.f_cpu=16000000L
attinyx7.menu.clock.16external.bootloader.file=empty/empty_all.hex
attinyx7.menu.clock.12external=12 MHz (external)
attinyx7.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.12external.build.f_cpu=12000000L
attinyx7.menu.clock.12external.bootloader.file=empty/empty_all.hex
attinyx7.menu.clock.8external=8 MHz (external)
attinyx7.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.8external.build.f_cpu=8000000L
attinyx7.menu.clock.8external.bootloader.file=empty/empty_all.hex
attinyx7.menu.clock.6external=6 MHz (external)
attinyx7.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx7.menu.clock.6external.build.f_cpu=6000000L
attinyx7.menu.clock.6external.bootloader.file=empty/empty_all.hex
attinyx7.menu.clock.4external=4 MHz (external)
attinyx7.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx7.menu.clock.4external.build.f_cpu=4000000L
attinyx7.menu.clock.4external.bootloader.file=empty/empty_all.hex
attinyx7.menu.clock.1internal=1 MHz (internal)
attinyx7.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx7.menu.clock.1internal.build.f_cpu=1000000L
attinyx7.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attinyx7.menu.bod.disable=B.O.D. Disabled
attinyx7.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx7.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx7.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx7.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx7.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx7.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx7.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx7.menu.pinmapping.new=New style (down each side)
attinyx7.menu.pinmapping.new.build.variant=tinyX7_New
attinyx7.menu.pinmapping.old=Old style (SCL on 13)
attinyx7.menu.pinmapping.old.build.variant=tinyX7

attinyx8.name=ATtiny x8 series
attinyx8.upload.tool=avrdude
attinyx8.build.board=AVR_ATTINYX8
attinyx8.bootloader.tool=avrdude
attinyx8.bootloader.unlock_bits=0x3F
attinyx8.bootloader.lock_bits=0x3F
attinyx8.build.core=tiny
attinyx8.menu.chip.88=ATtiny88
attinyx8.menu.chip.88.build.mcu=attiny88
attinyx8.menu.chip.88.upload.maximum_size=8192
attinyx8.menu.chip.88.upload.maximum_data_size=512
attinyx8.menu.chip.48=ATtiny48
attinyx8.menu.chip.48.build.mcu=attiny48
attinyx8.menu.chip.48.upload.maximum_size=4096
attinyx8.menu.chip.48.upload.maximum_data_size=256
attinyx8.bootloader.extended_fuses=0x07
attinyx8.menu.clock.8internal=8 MHz (internal)
attinyx8.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx8.menu.clock.8internal.build.f_cpu=8000000L
attinyx8.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attinyx8.menu.clock.1internal=1 MHz (internal)
attinyx8.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx8.menu.clock.1internal.build.f_cpu=1000000L
attinyx8.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attinyx8.menu.bod.disable=B.O.D. Disabled
attinyx8.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx8.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx8.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx8.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx8.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx8.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx8.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx8.build.variant=tinyX8

